//sort ascending
//

#include<bits/stdc++.h>
using namespace std;

int main(){
     int a[7]= {80, 50,-4,100, -40, 85, 60}      ;
   
    sort(a, a +5 );    // সর্ট .ফাংশনের মধ্যে স্টারটিং পয়েন্টার হিসেবে এরের প্রথম ইন্ডেক্স এবং এন্ডিং 
                       //পয়েন্টার হিসেবে এরের সাইজ দিয়ে দেওয়া হচ্ছে। তাহলে ০ ইনডেক্স থেকে 
                       // সাইজ-১ ইন্ডেক্স পর্যন্ত সর্ট হবে অর্থাৎ সম্পূর্ণ এরেটি সর্ট হবে।  
                       // আমরা যদি a+3  লিখতাম তাহলে ০ ইন্ডেক্স থেকে ২ ইনডেক্স পর্যন্ত সর্ট হতো। 
                       
    for (int i = 0; i < 7; i++)
        cout << a[i] << " ";       // এরে প্রিন্ট করা হচ্ছে। 
                                   // -40 -4 50 80 100 85 60 
                                   // 0  1  2  3    4  5  6   // 0,1,2,3,4 sort hobe
                                   // index 5,6 same achhe.
    return 0 ;
}
